package day2;

import java.util.Scanner;

/**
 * Реализовать программу, которая принимает на вход через консоль с помощью класса Scanner, число x.
 * Для этого числа, по формуле выше, необходимо вычислить значение y и вывести его в консоль,
 * используя метод System.out.println().
 * <p>
 * (Для этих вещественных чисел x и y необходимо использовать тип double и метод nextDouble()
 * у Scanner’а соответственно, чтобы считать из консоли число x).
 * <p>
 * Пояснение.
 * Формула для вычисления значения y содержит две составляющие - набор выражений для вычисления
 * значения y и условие, при котором то или иное выражение “срабатывает”. Выполнение того или иного
 * условия зависит от значения x. Например, если x = 100, будет использовано самое первое выражение.
 * С помощью него, используя значение x будет вычислено значение y.
 * y = (100^2 - 10) / (100 + 7) = 93.3644859813
 */

public class Task4 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        double x = scanner.nextDouble();
        double y;
        if (x >= 5) {
            y = (x * x - 10) / (x + 7);
        } else if (x < 5 && x > -3) {
            y = (x + 3) * (x * x - 2);
        } else {
            y = 420;
        }
        System.out.println(y);
    }
}
